Catalogs/Files.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Files</Name>
			<Comment>Files in folders</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileOwner</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:CatalogRef.Specifications</v8:Type>
						<v8:Type>cfg:DocumentRef.FixedAssetsDepreciation</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
						<v8:Type>cfg:CatalogRef.FileFolders</v8:Type>
						<v8:Type>cfg:CatalogRef.CustomerInvoiceNoteAttachedFiles</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
						<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerInvoiceNote</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.Event</v8:Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.InventoryReconciliation</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoiceForPayment</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LoanDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Definition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DigitallySigned</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullDescr</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsEditing</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersion</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionFileModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionPathToFile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionSize</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionExtension</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVolume</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StoreVersions</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteDataMoved</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteIDReceiverObject</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EncryptionCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Certificate</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ScannedImagesFormats.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ScannedImagesFormats</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>BMP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JPG</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GIF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PNG</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TIF</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/MultiplePageFilesStorageFormats.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>MultiplePageFilesStorageFormats</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>PDF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TIF</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/OnePageFilesStorageFormats.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>OnePageFilesStorageFormats</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>BMP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GIF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JPG</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PDF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PNG</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TIF</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Files/Forms/ScanningSetupForSession/Ext/Form/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Parameters.Property("AutoTest") Then
		Return;
	EndIf;
	
	Resolution = Parameters.Resolution;
	Chromaticity = Parameters.Chromaticity;
	Rotation = Parameters.Rotation;
	PaperSize = Parameters.PaperSize;
	DoubleSidedScan = Parameters.DoubleSidedScan;
	UseImageMagickForConvertionToPDF = Parameters.UseImageMagickForConvertionToPDF;
	ShowScannerDialog = Parameters.ShowScannerDialog;
	FormatOfScannedImage = Parameters.FormatOfScannedImage;
	JPGQuality = Parameters.JPGQuality;
	TIFFCompression = Parameters.TIFFCompression;
	OnePageStorageFormat = Parameters.OnePageStorageFormat;
	MultiPageStorageFormat = Parameters.MultiPageStorageFormat;
	
	Items.Rotation.Visible = Parameters.RotationAccessible;
	Items.PaperSize.Visible = Parameters.IsPaperSizeAccessible;
	Items.DoubleSidedScan.Visible = Parameters.EnabledDoubleSidedScan;
	
	JPGFormat = Enums.ScannedImagesFormats.JPG;
	TIFFormat = Enums.ScannedImagesFormats.TIF;
	
	MultiplePagesTIFFormat = Enums.MultiplePageFilesStorageFormats.TIF;
	OnePagePDFFormat = Enums.OnePageFilesStorageFormats.PDF;
	OnePageJPGFormat = Enums.OnePageFilesStorageFormats.JPG;
	OnePageTIFFormat = Enums.OnePageFilesStorageFormats.TIF;
	OnePagePNGFormat = Enums.OnePageFilesStorageFormats.PNG;
	
	If Not UseImageMagickForConvertionToPDF Then
		MultiPageStorageFormat = MultiplePagesTIFFormat;
	EndIf;
	
	Items.StorageFormatGroup.Visible = UseImageMagickForConvertionToPDF;
	
	If UseImageMagickForConvertionToPDF Then
		If OnePageStorageFormat = OnePagePDFFormat Then
			Items.JPGQuality.Visible = (FormatOfScannedImage = JPGFormat);
			Items.TIFFCompression.Visible = (FormatOfScannedImage = TIFFormat);
		Else
			Items.JPGQuality.Visible = (OnePageStorageFormat = OnePageJPGFormat);
			Items.TIFFCompression.Visible = (OnePageStorageFormat = OnePageTIFFormat);
		EndIf;
	Else	
		Items.JPGQuality.Visible = (FormatOfScannedImage = JPGFormat);
		Items.TIFFCompression.Visible = (FormatOfScannedImage = TIFFormat);
	EndIf;
	
	DecorationsVisible = (UseImageMagickForConvertionToPDF AND (OnePageStorageFormat = OnePagePDFFormat));
	Items.DecorationOnePageStorageFormat.Visible = DecorationsVisible;
	Items.DecorationFormatOfScannedImage.Visible = DecorationsVisible;
	
	ScanningFormatVisible = (UseImageMagickForConvertionToPDF AND (OnePageStorageFormat = OnePagePDFFormat)) OR (NOT UseImageMagickForConvertionToPDF);
	Items.ScanningFormatGroup.Visible = ScanningFormatVisible;
	
	Items.MultiPageStorageFormat.Enabled = UseImageMagickForConvertionToPDF;
	OnePageStorageFormatPrevious = OnePageStorageFormat;
	
	If Not UseImageMagickForConvertionToPDF Then
		Items.FormatOfScannedImage.Title = NStr("en = 'Format'");
	Else
		Items.FormatOfScannedImage.Title = NStr("en = 'Type'");
	EndIf;
	
	StandardSubsystemsServer.SetGroupHeadersDisplay(ThisObject,
		"GroupStorageFormatSingleRow,GroupMultiPageStorageFormat,GroupScanningParameters");
	
EndProcedure

#EndRegion

#Region HeaderFormItemsEventsHandlers

&AtClient
Procedure FormatOfScannedImageOnChange(Item)
	
	If UseImageMagickForConvertionToPDF Then
		If OnePageStorageFormat = OnePagePDFFormat Then
			Items.JPGQuality.Visible = (FormatOfScannedImage = JPGFormat);
			Items.TIFFCompression.Visible = (FormatOfScannedImage = TIFFormat);
		Else	
			Items.JPGQuality.Visible = (OnePageStorageFormat = OnePageJPGFormat);
			Items.TIFFCompression.Visible = (OnePageStorageFormat = OnePageTIFFormat);
		EndIf;
	Else	
		Items.JPGQuality.Visible = (FormatOfScannedImage = JPGFormat);
		Items.TIFFCompression.Visible = (FormatOfScannedImage = TIFFormat);
	EndIf;
	
EndProcedure

&AtClient
Procedure OnePageStorageFormatOnChange(Item)
	
	WorkChangesOnePageStorageFormat();
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

&AtClient
Procedure OK(Command)
	
	ChoiceResult = New Structure;
	ChoiceResult.Insert("ShowScannerDialog",  ShowScannerDialog);
	ChoiceResult.Insert("Resolution",               Resolution);
	ChoiceResult.Insert("Chromaticity",                Chromaticity);
	ChoiceResult.Insert("Rotation",                  Rotation);
	ChoiceResult.Insert("PaperSize",             PaperSize);
	ChoiceResult.Insert("DoubleSidedScan", DoubleSidedScan);
	
	ChoiceResult.Insert("UseImageMagickForConvertionToPDF",
		UseImageMagickForConvertionToPDF);
	
	ChoiceResult.Insert("FormatOfScannedImage", FormatOfScannedImage);
	ChoiceResult.Insert("JPGQuality",                     JPGQuality);
	ChoiceResult.Insert("TIFFCompression",                      TIFFCompression);
	ChoiceResult.Insert("OnePageStorageFormat",    OnePageStorageFormat);
	ChoiceResult.Insert("MultiPageStorageFormat",   MultiPageStorageFormat);
	
	NotifyChoice(ChoiceResult);
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtServer
Function ConvertStorageFormatIntoScanningFormat(StorageFormat)
	
	If StorageFormat = Enums.OnePageFilesStorageFormats.BMP Then
		Return Enums.ScannedImagesFormats.BMP;
	ElsIf StorageFormat = Enums.OnePageFilesStorageFormats.GIF Then
		Return Enums.ScannedImagesFormats.GIF;
	ElsIf StorageFormat = Enums.OnePageFilesStorageFormats.JPG Then
		Return Enums.ScannedImagesFormats.JPG;
	ElsIf StorageFormat = Enums.OnePageFilesStorageFormats.PNG Then
		Return Enums.ScannedImagesFormats.PNG; 
	ElsIf StorageFormat = Enums.OnePageFilesStorageFormats.TIF Then
		Return Enums.ScannedImagesFormats.TIF;
	EndIf;
	
	Return FormatOfScannedImage; 
	
EndFunction	

&AtServer
Procedure WorkChangesOnePageStorageFormat()
	
	Items.ScanningFormatGroup.Visible = (OnePageStorageFormat = OnePagePDFFormat);
	
	If OnePageStorageFormat = OnePagePDFFormat Then
		FormatOfScannedImage = ConvertStorageFormatIntoScanningFormat(OnePageStorageFormatPrevious);
	EndIf;
	
	DecorationsVisible = (UseImageMagickForConvertionToPDF AND (OnePageStorageFormat = OnePagePDFFormat));
	Items.DecorationOnePageStorageFormat.Visible = DecorationsVisible;
	Items.DecorationFormatOfScannedImage.Visible = DecorationsVisible;
	
	If UseImageMagickForConvertionToPDF Then
		If OnePageStorageFormat = OnePagePDFFormat Then
			Items.JPGQuality.Visible = (FormatOfScannedImage = JPGFormat);
			Items.TIFFCompression.Visible = (FormatOfScannedImage = TIFFormat);
		Else	
			Items.JPGQuality.Visible = (OnePageStorageFormat = OnePageJPGFormat);
			Items.TIFFCompression.Visible = (OnePageStorageFormat = OnePageTIFFormat);
		EndIf;
	Else	
		Items.JPGQuality.Visible = (FormatOfScannedImage = JPGFormat);
		Items.TIFFCompression.Visible = (FormatOfScannedImage = TIFFormat);
	EndIf;
	
	OnePageStorageFormatPrevious = OnePageStorageFormat;
	
EndProcedure

#EndRegion



// Rise { Popov N 2016-05-25
&AtClient
Function RiseGetFormInterfaceClient() Export
	Return RiseGetFormInterface();
EndFunction

&AtServer
Function RiseGetFormInterface()
	Return RiseTranslation.GetFormInterface(ThisForm);
EndFunction
// Rise } Popov N 2016-05-25
